Terraform creates the below resources and policy.

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_lambda_function_approved will be created
  + resource "turbot_policy_setting" "aws_lambda_function_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_lambda_function_approved_usage will be created
  + resource "turbot_policy_setting" "aws_lambda_function_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
              {% set current_time = now | date("constructor") | date("getTime") %}
              {% set lastmodified_time = $.resource.data.Configuration.LastModified | date("getTime") %}
              {% if "ApplicationID" not in $.resource.turbot.tags and duration > 300000 %}
              Not approved
              {% else %}
              Approved
              {% endif %}
              {% endif %}
        EOT
      + template_input               = <<~EOT
              {
                resource {
                  data
                  metadata
                  trunk {
                    title
                  }
                  turbot {
                    akas
                    id
                    tags
                  }
                }
              }
        EOT
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.lambda_approved will be created
  + resource "turbot_smart_folder" "lambda_approved" {
      + description = "Lambda Approved Usage"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Lambda Approved Usage"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.lambda_approved: Creating...
turbot_smart_folder.lambda_approved: Creation complete after 1s [id=214939064742351]
turbot_policy_setting.aws_lambda_function_approved_usage: Creating...
turbot_policy_setting.aws_lambda_function_approved: Creating...
turbot_policy_setting.aws_lambda_function_approved_usage: Creation complete after 1s [id=214939066671572]
turbot_policy_setting.aws_lambda_function_approved: Creation complete after 1s [id=214939066759641]


```